### 데이터 필터링 - Boolean Indexing
- Series/DataFrame에서 원하는 조건의 데이터만 추출하기 위한 것
- True와 False로 구성된 데이터 ==> 인덱스로 사용

In [1]:
import pandas as pd

In [2]:
data = {'name':['마징가', '베트맨', '홍길동'],
        'age':[25, 31, 19],
        'gender':['남', '남', '여']}

In [3]:
data_df = pd.DataFrame(data)

In [4]:
data_df

  name  age gender
0  마징가   25      남
1  베트맨   31      남
2  홍길동   19      여

In [8]:
# 데이터 추출
# - 성별이 남자인 데이터만 추출
bool_idx = data_df['gender'] == '남'

In [9]:
data_df[bool_idx]

  name  age gender
0  마징가   25      남
1  베트맨   31      남

In [13]:
# - 30세 이상의 남자 데이터만 추출
bool_idx = (data_df['age'] >= 30) & (data_df['gender'] == '남')

In [14]:
data_df[bool_idx]

  name  age gender
1  베트맨   31      남

In [16]:
# - 20세 이하이거나 성별이 남자인 데이터만 추출
bool_idx = (data_df['age'] <= 20) | (data_df['gender'] == '남')

In [17]:
data_df[bool_idx]

  name  age gender
0  마징가   25      남
1  베트맨   31      남
2  홍길동   19      여

In [19]:
# -  설병이 남자가 아닌 데이터만 추출
data_df[data_df['gender'] != '남']

  name  age gender
2  홍길동   19      여

In [22]:
# 다른 기호
data_df[~ (data_df['gender'] == '남')]

  name  age gender
2  홍길동   19      여